
**** Node record
  - Object-Oriented programming makes linked lists easy to implement
  - Example:
#+BEGIN_SRC python
  class Node:
      data
      nextItem

  first = Node()
  second = Node()
  third = Node()
  first.data = "to"
  second.data = "be"
  third.data = "or"
  first.next = second
  second.next = third
#+END_SRC

#+RESULTS:
  - Linked list represents a sequence of items
  - Could also use an array to represent the data
#+BEGIN_SRC python
  a = ['to', 'be', 'or']

#+END_SRC

#+RESULTS:
: None
  - Difference between the linked-list vs array
    - linked list is easier to insert a value in the middle
    - Array is easier to append a value at the end
  - link: node reference
